---
title: TessellatedBuildIssue
classe: Autodesk.Revit.DB.TessellatedBuildIssue
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# TessellatedBuildIssue

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `tessellatedBuildIssue.IsValidObject` | Boolean |
| `Int32 NumberEncountered { get; }` | `tessellatedBuildIssue.NumberEncountered` | Int32 |
| `Void Dispose()` | `tessellatedBuildIssue.Dispose()` | Void |
| `String GetIssueDescription()` | `tessellatedBuildIssue.GetIssueDescription()` | String |
| `Boolean IsValidIssue()` | `tessellatedBuildIssue.IsValidIssue()` | Boolean |
| `Boolean MakesDataUnusable()` | `tessellatedBuildIssue.MakesDataUnusable()` | Boolean |
| `Boolean ReportIssueToDataSource()` | `tessellatedBuildIssue.ReportIssueToDataSource()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```